-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost:8889
-- 生成日時: 2022 年 1 月 03 日 04:30
-- サーバのバージョン： 5.7.34
-- PHP のバージョン: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `2021_hackathon`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `room`
--

CREATE TABLE `room` (
  `id` int(11) NOT NULL,
  `date` json NOT NULL,
  `title` text COLLATE utf8mb4_bin NOT NULL,
  `comment` text COLLATE utf8mb4_bin NOT NULL,
  `room_url` text COLLATE utf8mb4_bin NOT NULL,
  `updated_at` datetime NOT NULL,
  `created_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `room`
--

INSERT INTO `room` (`id`, `date`, `title`, `comment`, `room_url`, `updated_at`, `created_at`) VALUES
(1, '[\"2022-1-4\", \"2022-1-5\", \"2022-1-6\"]', 'test', 'huga', 'fe9928f64084429de4b22453be335e58', '2022-01-02 21:23:11', '2022-01-02 21:23:11'),
(2, '[\"2022-1-4\", \"2022-1-5\", \"2022-1-6\", \"2022-1-7\", \"2022-1-8\", \"2022-1-9\", \"2022-1-10\"]', '新年会', '18:00〜開催します\r\n日程を教えてください！', '517b8806fa4c1eb82fea445c0ab51746', '2022-01-03 01:14:58', '2022-01-03 01:14:58'),
(3, '[\"2022-1-8\", \"2022-1-9\", \"2022-1-15\", \"2022-1-16\", \"2022-1-22\", \"2022-1-23\", \"2022-1-29\", \"2022-1-30\"]', '新年会', '18:00〜 のご予定はいかがでしょうか？\r\n明日までに回答してください。', '21c750428ceab042a8d433d65497f512', '2022-01-03 01:21:05', '2022-01-03 01:21:05'),
(4, '[\"2022-1-3（月）\", \"2022-1-12（水）\", \"2022-1-14（金）\", \"2022-1-17（月）\", \"2022-1-21（金）\", \"2022-1-25（火）\", \"2022-1-28（金）\", \"2022-1-29（土）\"]', 'タイトル', 'あああ', '74bf04938f15e837a71078312394bd03', '2022-01-03 01:31:08', '2022-01-03 01:31:08'),
(5, '[\"1月6日（木）\", \"1月7日（金）\", \"1月8日（土）\", \"1月12日（水）\"]', 'あああ', 'あああ', 'a42a19ad1eabfd56d7eaacf9548d4573', '2022-01-03 01:32:22', '2022-01-03 01:32:22'),
(6, '[\"1月12日（水）\", \"1月13日（木）\", \"1月14日（金）\", \"1月15日（土）\", \"1月16日（日）\", \"1月17日（月）\", \"1月18日（火）\"]', '', '', '3ce436c1a803abbe6369264fcc7ff197', '2022-01-03 02:47:03', '2022-01-03 02:47:03'),
(7, '[\"1月26日（水）\"]', 'aa', 'aaa', '8a350f246f9f2e4e6dc3a7e0aa3481d1', '2022-01-03 02:51:12', '2022-01-03 02:51:12'),
(8, '[\"2月5日（土）\", \"2月6日（日）\", \"2月12日（土）\", \"2月13日（日）\", \"2月19日（土）\", \"2月20日（日）\", \"2月26日（土）\", \"2月27日（日）\"]', 'あああ', 'ああああああああああああああああああああああああああああああああああああああああああああああああああああ', '24eaca90e6a37f4c4d4d59302898e90b', '2022-01-03 03:21:54', '2022-01-03 03:21:54'),
(9, '[\"1月9日（日）\", \"1月15日（土）\", \"1月16日（日）\", \"1月22日（土）\", \"1月23日（日）\", \"1月29日（土）\", \"1月30日（日）\"]', '新年会', '18:00〜開催します。明日までに入力してください。', '17987c96a88e7493457fa3ed21be62f0', '2022-01-03 09:59:37', '2022-01-03 09:59:37');

-- --------------------------------------------------------

--
-- テーブルの構造 `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `room_url` text COLLATE utf8mb4_bin NOT NULL,
  `name` text COLLATE utf8mb4_bin NOT NULL,
  `answer` json NOT NULL,
  `allergy` json NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

--
-- テーブルのデータのダンプ `users`
--

INSERT INTO `users` (`id`, `room_url`, `name`, `answer`, `allergy`, `created_at`, `updated_at`) VALUES
(2, 'fe9928f64084429de4b22453be335e58', '', '{\"2022-1-4\": \"○\", \"2022-1-5\": \"○\", \"2022-1-6\": \"○\"}', 'null', '2022-01-02 22:20:31', '2022-01-02 22:20:31'),
(3, 'fe9928f64084429de4b22453be335e58', 'hogehoge', '{\"2022-1-4\": \"○\", \"2022-1-5\": \"×\", \"2022-1-6\": \"△\"}', 'null', '2022-01-02 22:34:29', '2022-01-02 22:34:29'),
(4, 'a42a19ad1eabfd56d7eaacf9548d4573', 'すみだ', '{\"1月6日（木）\": \"○\", \"1月7日（金）\": \"△\", \"1月8日（土）\": \"×\", \"1月12日（水）\": \"○\"}', '[\"えび\", \"かに\"]', '2022-01-03 01:33:56', '2022-01-03 01:33:56'),
(5, '24eaca90e6a37f4c4d4d59302898e90b', '澄田', '{\"2月5日（土）\": \"○\", \"2月6日（日）\": \"○\", \"2月12日（土）\": \"△\", \"2月13日（日）\": \"○\", \"2月19日（土）\": \"○\", \"2月20日（日）\": \"×\", \"2月26日（土）\": \"×\", \"2月27日（日）\": \"△\"}', '[\"えび\", \"かに\"]', '2022-01-03 03:32:02', '2022-01-03 03:32:02'),
(6, '24eaca90e6a37f4c4d4d59302898e90b', 'aaaa', '{\"2月5日（土）\": \"○\", \"2月6日（日）\": \"○\", \"2月12日（土）\": \"○\", \"2月13日（日）\": \"×\", \"2月19日（土）\": \"×\", \"2月20日（日）\": \"×\", \"2月26日（土）\": \"×\", \"2月27日（日）\": \"×\"}', '[\"アーモンド\", \"カシューナッツ\", \"キウイフルーツ\"]', '2022-01-03 03:39:29', '2022-01-03 03:39:29'),
(7, '24eaca90e6a37f4c4d4d59302898e90b', 'bbb', '{\"2月5日（土）\": \"○\", \"2月6日（日）\": \"○\", \"2月12日（土）\": \"○\", \"2月13日（日）\": \"×\", \"2月19日（土）\": \"×\", \"2月20日（日）\": \"×\", \"2月26日（土）\": \"×\", \"2月27日（日）\": \"×\"}', '[\"えび\", \"アーモンド\", \"カシューナッツ\"]', '2022-01-03 03:45:11', '2022-01-03 03:45:11'),
(8, '17987c96a88e7493457fa3ed21be62f0', 'すみだ', '{\"1月9日（日）\": \"○\", \"1月15日（土）\": \"○\", \"1月16日（日）\": \"△\", \"1月22日（土）\": \"△\", \"1月23日（日）\": \"△\", \"1月29日（土）\": \"×\", \"1月30日（日）\": \"×\"}', '[\"えび\", \"かに\"]', '2022-01-03 10:01:30', '2022-01-03 10:01:30'),
(9, '17987c96a88e7493457fa3ed21be62f0', 'テスト', '{\"1月9日（日）\": \"○\", \"1月15日（土）\": \"△\", \"1月16日（日）\": \"×\", \"1月22日（土）\": \"○\", \"1月23日（日）\": \"×\", \"1月29日（土）\": \"△\", \"1月30日（日）\": \"×\"}', 'null', '2022-01-03 10:05:51', '2022-01-03 10:05:51');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `room`
--
ALTER TABLE `room`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `room`
--
ALTER TABLE `room`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- テーブルの AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
